<a href="https://colab.research.google.com/github/MOHAN0283/python_new/blob/module_3/pandasprac.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas

In [ ]:
import pandas as mk

In [ ]:
a=mk.read_csv("data.csv")
print(a)

        NAME  AGE  MARKS     DATE
0       HEMA   20     95   1-5-22
1    PRADEEP   10     99   1-5-22
2    SANKALP   15     97   2-5-22
3      PAWAN   20     94   2-5-22
4   PRANEETH   16     85   3-5-22
5      MOHAN   18     99   3-5-22
6    KRISHNA   14    100   4-5-22
7      RISHI   12     98   4-5-22
8      SWYAM   21     97   5-5-22
9   CHITANYA   22     96   5-5-22
10    LOKESH   30     91   6-5-22
11      SAMI   25     92   6-5-22
12   AVINASH   40     84   7-5-22
13    BALAJI    9     80   7-5-22
14   VEDHESH   16     90   8-5-22
15   ABHINAV   17     95   8-5-22
16     SUBHU   25     96   9-5-22
17     NEHAL   22     96   9-5-22
18    KARTHI   12     99  10-5-22

In [ ]:
a=mk.read_csv("data.csv")
a.dropna(subset=['NAME'], inplace = True)
print(a)

        NAME  AGE  MARKS     DATE
0       HEMA   20     95   1-5-22
1    PRADEEP   10     99   1-5-22
2    SANKALP   15     97   2-5-22
3      PAWAN   20     94   2-5-22
4   PRANEETH   16     85   3-5-22
5      MOHAN   18     99   3-5-22
6    KRISHNA   14    100   4-5-22
7      RISHI   12     98   4-5-22
8      SWYAM   21     97   5-5-22
9   CHITANYA   22     96   5-5-22
10    LOKESH   30     91   6-5-22
11      SAMI   25     92   6-5-22
12   AVINASH   40     84   7-5-22
13    BALAJI    9     80   7-5-22
14   VEDHESH   16     90   8-5-22
15   ABHINAV   17     95   8-5-22
16     SUBHU   25     96   9-5-22
17     NEHAL   22     96   9-5-22
18    KARTHI   12     99  10-5-22

In [ ]:
a=mk.read_csv("data.csv")
b=mk.DataFrame(a)
print(b)

        NAME  AGE  MARKS     DATE
0       HEMA   20     95   1-5-22
1    PRADEEP   10     99   1-5-22
2    SANKALP   15     97   2-5-22
3      PAWAN   20     94   2-5-22
4   PRANEETH   16     85   3-5-22
5      MOHAN   18     99   3-5-22
6    KRISHNA   14    100   4-5-22
7      RISHI   12     98   4-5-22
8      SWYAM   21     97   5-5-22
9   CHITANYA   22     96   5-5-22
10    LOKESH   30     91   6-5-22
11      SAMI   25     92   6-5-22
12   AVINASH   40     84   7-5-22
13    BALAJI    9     80   7-5-22
14   VEDHESH   16     90   8-5-22
15   ABHINAV   17     95   8-5-22
16     SUBHU   25     96   9-5-22
17     NEHAL   22     96   9-5-22
18    KARTHI   12     99  10-5-22

In [ ]:
d=b.drop_duplicates()
print(d)

        NAME  AGE  MARKS     DATE
0       HEMA   20     95   1-5-22
1    PRADEEP   10     99   1-5-22
2    SANKALP   15     97   2-5-22
3      PAWAN   20     94   2-5-22
4   PRANEETH   16     85   3-5-22
5      MOHAN   18     99   3-5-22
6    KRISHNA   14    100   4-5-22
7      RISHI   12     98   4-5-22
8      SWYAM   21     97   5-5-22
9   CHITANYA   22     96   5-5-22
10    LOKESH   30     91   6-5-22
11      SAMI   25     92   6-5-22
12   AVINASH   40     84   7-5-22
13    BALAJI    9     80   7-5-22
14   VEDHESH   16     90   8-5-22
15   ABHINAV   17     95   8-5-22
16     SUBHU   25     96   9-5-22
17     NEHAL   22     96   9-5-22
18    KARTHI   12     99  10-5-22

In [ ]:
a=mk.read_csv("passport.csv")
b=mk.DataFrame(a)
print(b)

   S.NO     NAME  AGE   PH.NO         EMAIL                 ADDRESS  \
0     1    MOHAN   18  123456  m@mkmail.com  a lane b street c city
1     2    RISHI   12  654321  r@mkmail.com  b lane c street e city
2     3  SANKALP   20  741852  s@mkmail.com  c lane d street f city
3     4     HEMA   25  963258  h@mkmail.com  d lane e street g city
4     5  PRADEEP   22  965874  p@mkmail.com  e lane z street n city
5     6    Pavan   24  951753  x@mkmail.com  e lane f street g city
6     7    Swyam    8  357159  c@mkmail.com  g lane h street i city
7     8   Lokesh    2  159753  a@mkmail.com  h lane i street j city
8     9     Sami    5  753159  d@mkmail.com  j lane k street l city
9    10  Krishna   19  742356  z@mkmail.com  m lane n street o city

  PASSPORT(yes/no) LISCENSE
0              yes      yes
1               no       no
2              yes      yes
3              yes       no
4               no      yes
5              yes       no
6               no      yes
7              yes       no
8              yes      yes
9               no       no

In [ ]:
d=mk.read_csv("passport.csv")
d.aggregate({'PH.NO':['max','min','sum','average'],"AGE":['min','max','sum','average']})

             PH.NO    AGE
max       965874.0   25.0
min       123456.0    2.0
sum      6412941.0  155.0
average   641294.1   15.5

In [ ]:
d=mk.read_csv("passport.csv")
z=d.groupby(by=['ADDRESS','AGE','PH.NO'])
z.first()

,,,S.NO,NAME,EMAIL,PASSPORT(yes/no),LISCENSE
ADDRESS,AGE,PH.NO,,,,,
a lane b street c city,18,123456,1,MOHAN,m@mkmail.com,yes,yes
b lane c street e city,12,654321,2,RISHI,r@mkmail.com,no,no
c lane d street f city,20,741852,3,SANKALP,s@mkmail.com,yes,yes
d lane e street g city,25,963258,4,HEMA,h@mkmail.com,yes,no
e lane f street g city,24,951753,6,Pavan,x@mkmail.com,yes,no
e lane z street n city,22,965874,5,PRADEEP,p@mkmail.com,no,yes
g lane h street i city,8,357159,7,Swyam,c@mkmail.com,no,yes
h lane i street j city,2,159753,8,Lokesh,a@mkmail.com,yes,no
j lane k street l city,5,753159,9,Sami,d@mkmail.com,yes,yes
m lane n street o city,19,742356,10,Krishna,z@mkmail.com,no,no